# Gözlem ve Değişken Seçimi

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
m = np.random.randint(1,30, size = (10,3))

In [4]:
df = pd.DataFrame(m, columns = ["var1", "var2", "var3"])

In [5]:
df

   var1  var2  var3
0    26    17     6
1    28    13     1
2    21    21    24
3     2     4    15
4    26    26    29
5     6     1    17
6    19    24    19
7     8     5     7
8    17    29    13
9    21     2     8

In [7]:
# loc : tanımlandığı şekil ile seçim yapmak için kullanılır

In [8]:
df.loc[0:3]

   var1  var2  var3
0    26    17     6
1    28    13     1
2    21    21    24
3     2     4    15

In [9]:
# iloc : alışık olduğumuz indexleme mantığıyla seçim yapar

In [10]:
df.iloc[0:3]

   var1  var2  var3
0    26    17     6
1    28    13     1
2    21    21    24

In [11]:
df.iloc[0,0]

26

In [12]:
df.iloc[:3, :2]

   var1  var2
0    26    17
1    28    13
2    21    21

In [13]:
df.loc[0:3, "var3"]

0     6
1     1
2    24
3    15
Name: var3, dtype: int32

In [15]:
df.iloc[0:3]["var3"]

0     6
1     1
2    24
Name: var3, dtype: int32